[
  {
    "id": 1,
    "name": "Arman Hossain",
    "category": "Cycling",
    "photo": "https://i.ibb.co/yF9JxqDg/male-trekker-takes-breathtaking-mountain-landscape-rocks.jpg",
    "snippet": "Joining HobbyHub changed my life. I met local cyclists who encouraged me to take part in a 50km event. Now, I ride every weekend, improving my stamina and connecting with a great community. Cycling has become my therapy and stress-relief. Thanks to the group, I even fixed my first flat tire. More than a hobby, it's a lifestyle now."
  },
  {
    "id": 2,
    "name": "Rakib Ahmed",
    "category": "Reading",
    "photo": "https://i.ibb.co/TBh1Km6c/man-reading-book-white-background.jpg",
    "snippet": "Through HobbyHub, I discovered a reading group that discusses books every Sunday. It motivated me to read regularly. I made friends with similar tastes, and now we exchange book recommendations. The shared love for fiction has brought new perspective into my daily life and improved my vocabulary too. I'm currently reading 2 books a month!"
  },
  {
    "id": 3,
    "name": "Shafayet Karim",
    "category": "Gardening",
    "photo": "https://i.ibb.co/MDCyZhHx/outdoors-portrait-young-good-looking-caucasian-bearded-man-blue-shirt-gloves-smiling-camera-holding.jpg",
    "snippet": "I never thought gardening could bring so much joy until I joined a group here. From learning soil types to composting hacks, HobbyHub introduced me to passionate growers. I now grow tomatoes, herbs, and even roses on my rooftop. It brings me peace every morning. My little garden has become the talk of my neighborhood!"
  },
  {
    "id": 4,
    "name": "Nayeem Rahman",
    "category": "Fishing",
    "photo": "https://i.ibb.co/S7XwJyCf/man-near-river-fishing-morning.jpg",
    "snippet": "Fishing was just a childhood memory until I joined a local hobby group via HobbyHub. Weekly fishing trips became the highlight of my weekends. I've even taught my younger brother how to cast a line. I now own two fishing rods and can confidently tie my own lures. It’s peaceful, fun, and something I’ll do for life."
  },
  {
    "id": 5,
    "name": "Tariq Hasan",
    "category": "Drawing & Painting",
    "photo": "https://i.ibb.co/vxpm9xdV/front-view-young-male-painter-along-with-easel-white-background.jpg",
    "snippet": "I joined a digital art group and started learning sketching on my tablet. Members shared techniques, tutorials, and even gave feedback. Within a few months, my art improved a lot and now I’m thinking of selling prints. The support here is amazing. I never imagined strangers could inspire me to grow my talent this much!"
  },
  {
    "id": 6,
    "name": "Rafsan Chowdhury",
    "category": "Cooking",
    "photo": "https://i.ibb.co/BKgr0B05/man-cooking-home.jpg",
    "snippet": "Cooking used to scare me, but HobbyHub helped me find a group for beginner-friendly recipes. The group members even hosted a virtual cook-off! I now make my own pasta and biryani. My family loves it, and it feels great to surprise them with new dishes every week. I’ve never felt this confident in the kitchen!"
  },
  {
    "id": 7,
    "name": "Nasim Uddin",
    "category": "Running",
    "photo": "https://i.ibb.co/YB62ZtQK/full-shot-man-running-nature.jpg",
    "snippet": "I struggled with consistency until I joined a running challenge group on HobbyHub. Members share daily progress, training tips, and it keeps me accountable. I started with 1km and now run 5km daily. It has boosted my mental and physical health. I even signed up for my first city marathon next month!"
  },
  {
    "id": 8,
    "name": "Asif Mahmud",
    "category": "Cycling",
    "photo": "https://i.ibb.co/v4MGcfDV/adult-asphalt-bike-background-bicycle.jpg",
    "snippet": "From late-night rides to hilly terrain, HobbyHub's cycling group opened up adventures I never imagined. I met riders who pushed me beyond my limits and now I feel fitter than ever. I recently upgraded to a new road bike and plan to take part in a regional tour. Best decision I ever made!"
  },
  {
    "id": 9,
    "name": "Hasibul Alam",
    "category": "Reading",
    "photo": "https://i.ibb.co/gFyzsPV2/businessman-with-book.jpg",
    "snippet": "My reading habit was inconsistent, but the HobbyHub book club gave it structure. We read classics, modern fiction, and hold debates. I’ve improved my analytical skills and feel more confident in discussions. It’s not just about books—it’s about building ideas and lifelong learning. I’m thankful for this amazing group."
  }
 
]
